In [5]:
import pandas as pd

In [ ]:
#Series 

data=[10,22,3,34,667,33]
series=pd.Series(data)
print(series)

In [ ]:
#use dictionary to create series 
data = {'Alice': 25, 'Bob': 30, 'Charlie': 35}
s = pd.Series(data)
print(s)

In [6]:
#DataFrame
#use dictionaries to create dataframe

# Dictionary data
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [9]:
import pandas as pd
df=pd.read_csv('customer_data.csv')
df.head(5) #getting first 5 elements of the csv file 
df.describe()

              Age  SpendingScore   AnnualIncome
count  500.000000     500.000000     500.000000
mean    43.696000      50.740000   71109.364000
std     14.813455      28.461703   28655.511323
min     18.000000       1.000000   20113.000000
25%     31.000000      26.750000   45576.500000
50%     44.000000      51.000000   70356.000000
75%     56.000000      75.000000   96360.750000
max     69.000000      99.000000  119967.000000

In [4]:
df.tail(22)
df['Name']
df.loc[0]
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [5]:
df.loc[0, 'Name']     # First row, column 'Name'
df.iloc[0, 0]         # First row, first column

'Alice'

In [7]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [2]:
import pandas as pd
pd.DataFrame({'Yes': [50, 21], 'No': [131, 2]})

   Yes   No
0   50  131
1   21    2